Revit.Elements.Toposolid
A Revit Toposolid

Revit.Elements.Toposolid.InternalToposolid
An internal handle on the Revit Toposolid

Revit.Elements.Toposolid.InternalElement
Reference to the Element

Revit.Elements.Toposolid.#ctor(Autodesk.Revit.DB.Toposolid)
Private constructor

Revit.Elements.Toposolid.#ctor(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.List{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Toposolid.#ctor(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Toposolid.#ctor(System.Collections.Generic.List{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Private constructor

Revit.Elements.Toposolid.InitToposolid(Autodesk.Revit.DB.Toposolid)
Initialize a toposolid element

Revit.Elements.Toposolid.InitToposolid(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},System.Collections.Generic.List{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Initialize a toposolid element

Revit.Elements.Toposolid.InitToposolid(System.Collections.Generic.List{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Initialize a toposolid element

Revit.Elements.Toposolid.InitToposolid(System.Collections.Generic.List{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.ToposolidType,Autodesk.Revit.DB.Level)
Initialize a toposolid element

Revit.Elements.Toposolid.InternalSetToposolid(Autodesk.Revit.DB.Toposolid)
Set the InternalToposolid property and the associated element id and unique id
toposolid:

Revit.Elements.Toposolid.Points
Get Slab Shape Points

Revit.Elements.Toposolid.ByOutlinePointsTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Revit.Elements.ToposolidType,Revit.Elements.Level)
Create a Revit Toposolid given its curve outline, points, type and Level
outlineCurves:
points:
toposolidType:
level:
Returns:
Throws System.ArgumentNullException:

Revit.Elements.Toposolid.ByOutlinePointsTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Revit.Elements.ToposolidType,Revit.Elements.Level)
Create a Revit Toposolid given its curve outline, points, type and Level
outline:
points:
toposolidType:
level:
Returns:
Throws System.ArgumentNullException:
Throws System.ArgumentException:

Revit.Elements.Toposolid.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.ToposolidType,Revit.Elements.Level)
Create a Revit Toposolid given its curve outline, type and Level
outlineCurves:
toposolidType:
level:
Returns:
Throws System.ArgumentNullException:

Revit.Elements.Toposolid.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,Revit.Elements.ToposolidType,Revit.Elements.Level)
Create a Revit Toposolid given its curve outline, type and Level
outline:
toposolidType:
level:
Returns:
Throws System.ArgumentNullException:
Throws System.ArgumentException:

Revit.Elements.Toposolid.ByPointsTypeAndLevel(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Revit.Elements.ToposolidType,Revit.Elements.Level)
Create a Revit Toposolid given its points, type and Level
points:
toposolidType:
level:
Returns:
Throws System.ArgumentNullException:

Revit.Elements.Toposolid.FromExisting(Autodesk.Revit.DB.Toposolid,System.Boolean)
Create a Toposolid from a user selected Element.
toposolid:
isRevitOwned:
Returns: